In [42]:
import ibis
from decouple import config, AutoConfig

In [3]:
con = ibis.connect("duckdb://penguins.ddb")

In [5]:
csv_path = r'C:\Users\Zygim\Downloads\archive\weather_data.csv'
table_name = 'weather_data'

In [6]:
con.raw_sql(f"""CREATE TABLE {table_name} AS SELECT * FROM read_csv_auto('{csv_path}');""")

In [8]:
con.list_tables()

['weather_data']

In [21]:
con.raw_sql(f"""SELECT * FROM {table_name} LIMIT 10""").fetchdf()

,Location,Date_Time,Temperature_C,Humidity_pct,Precipitation_mm,Wind_Speed_kmh
0,San Diego,2024-01-14 21:12:46,10.683001,41.195754,4.020119,8.233540
1,San Diego,2024-05-17 15:22:10,8.734140,58.319107,9.111623,27.715161
2,San Diego,2024-05-11 09:30:59,11.632436,38.820175,4.607511,28.732951
3,Philadelphia,2024-02-26 17:32:39,-8.628976,54.074474,3.183720,26.367303
4,San Antonio,2024-04-29 13:23:51,39.808213,72.899908,9.598282,29.898622
5,San Diego,2024-01-21 08:54:56,27.341055,49.023236,9.166543,27.473896
6,San Jose,2024-01-13 02:10:54,1.881883,65.742325,0.221709,1.073112
7,New York,2024-01-25 19:04:34,-6.894766,30.804894,8.027624,16.848337
8,New York,2024-03-29 05:20:30,0.963545,38.819158,3.640129,7.989024
9,San Jose,2024-05-18 09:14:02,-1.607088,82.198701,4.101493,25.647282

In [13]:
table = con.table(table_name)

In [15]:
table.schema()

ibis.Schema {
  Location          string
  Date_Time         timestamp(6)
  Temperature_C     float64
  Humidity_pct      float64
  Precipitation_mm  float64
  Wind_Speed_kmh    float64
}

In [22]:
con.raw_sql(f"""SELECT * FROM {table_name} LIMIT 10""").fetchdf()

,Location,Date_Time,Temperature_C,Humidity_pct,Precipitation_mm,Wind_Speed_kmh
0,San Diego,2024-01-14 21:12:46,10.683001,41.195754,4.020119,8.233540
1,San Diego,2024-05-17 15:22:10,8.734140,58.319107,9.111623,27.715161
2,San Diego,2024-05-11 09:30:59,11.632436,38.820175,4.607511,28.732951
3,Philadelphia,2024-02-26 17:32:39,-8.628976,54.074474,3.183720,26.367303
4,San Antonio,2024-04-29 13:23:51,39.808213,72.899908,9.598282,29.898622
5,San Diego,2024-01-21 08:54:56,27.341055,49.023236,9.166543,27.473896
6,San Jose,2024-01-13 02:10:54,1.881883,65.742325,0.221709,1.073112
7,New York,2024-01-25 19:04:34,-6.894766,30.804894,8.027624,16.848337
8,New York,2024-03-29 05:20:30,0.963545,38.819158,3.640129,7.989024
9,San Jose,2024-05-18 09:14:02,-1.607088,82.198701,4.101493,25.647282

In [27]:
con.sql("""
  SELECT * FROM weather_data
""")

SQLQueryResult
  query:
    SELECT * FROM weather_data
  schema:
    Location         string
    Date_Time        timestamp(6)
    Temperature_C    float64
    Humidity_pct     float64
    Precipitation_mm float64
    Wind_Speed_kmh   float64

# Section 5 Remember

In [45]:
config = AutoConfig(search_path=r'F:\DataSpell\data_engineering_essentials_using_sql_python_pyspark')

postgres = ibis.postgres.connect(
    host=config('HOST'),
    port=config('PORT'),
    user=config('USER'),
    password=config('PASSWORD'),
    database=config('DATABASE')
)

In [46]:
postgres.list_tables()

['categories',
 'customers',
 'daily_product_revenue',
 'daily_revenue',
 'departments',
 'order_count_by_status',
 'order_details_v',
 'order_items',
 'orders',
 'orders_stg',
 'products',
 'student_scores']

In [61]:
con.raw_sql(f"""SELECT * FROM weather_data""").fetchdf()

,Location,Date_Time,Temperature_C,Humidity_pct,Precipitation_mm,Wind_Speed_kmh
0,San Diego,2024-01-14 21:12:46,10.683001,41.195754,4.020119,8.233540
1,San Diego,2024-05-17 15:22:10,8.734140,58.319107,9.111623,27.715161
2,San Diego,2024-05-11 09:30:59,11.632436,38.820175,4.607511,28.732951
3,Philadelphia,2024-02-26 17:32:39,-8.628976,54.074474,3.183720,26.367303
4,San Antonio,2024-04-29 13:23:51,39.808213,72.899908,9.598282,29.898622
...,...,...,...,...,...,...
999995,Dallas,2024-01-01 20:29:48,23.416877,37.705024,3.819833,16.538119
999996,San Antonio,2024-01-20 15:59:48,6.759080,40.731036,8.182785,29.005558
999997,New York,2024-04-14 08:30:09,15.664465,62.201884,3.987558,0.403909
999998,Chicago,2024-05-12 20:10:43,18.999994,63.703245,4.294325,6.326036
999999,New York,2024-04-16 16:11:52,10.725351,43.804584,1.883292,15.363828

In [65]:
con.raw_sql("""
    SELECT *
    FROM weather_data
    WHERE Location IN ('San Antonio', 'New York')
""").fetchdf()

,Location,Date_Time,Temperature_C,Humidity_pct,Precipitation_mm,Wind_Speed_kmh
0,San Antonio,2024-04-29 13:23:51,39.808213,72.899908,9.598282,29.898622
1,San Antonio,2024-02-10 15:05:28,16.349790,65.812607,0.109090,6.597039
2,San Antonio,2024-05-08 16:20:53,35.179548,35.083071,9.597294,4.507863
3,San Antonio,2024-02-14 04:43:05,30.739684,85.603779,9.250559,24.375952
4,San Antonio,2024-02-08 20:45:03,3.017951,49.868218,6.906614,6.212008
...,...,...,...,...,...,...
199929,New York,2024-01-30 15:04:59,1.837912,66.505813,4.934130,4.797305
199930,New York,2024-01-01 11:49:20,20.245916,31.677558,9.801482,24.029331
199931,New York,2024-02-14 03:55:10,4.210758,45.683075,2.053384,22.351735
199932,New York,2024-04-14 08:30:09,15.664465,62.201884,3.987558,0.403909
199933,New York,2024-04-16 16:11:52,10.725351,43.804584,1.883292,15.363828

In [71]:
con.raw_sql("""
    SELECT count(DISTINCT Location)
    FROM weather_data
""").fetchdf()

   count(DISTINCT "Location")
0                          10

In [74]:
con.raw_sql("""
    SELECT round(SUM(Precipitation_mm), 2)
    FROM weather_data
    WHERE Location = 'San Antonio'
""").fetchdf()

   round(sum(Precipitation_mm), 2)
0                        500618.82